blog/2021/9238-learn-search.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-01-17 Mon 21:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>搜索引擎 9238 谈怎样学搜索</title>
<meta name="generator" content="Org mode">
<link rel="preconnect" href="https://fonts.googleapis.com"><link rel="preconnect" href="https://fonts.gstatic.com" crossorigin><link href="https://fonts.googleapis.com/css2?family=Noto+Sans+SC&display=swap" rel="stylesheet">
<link rel="stylesheet" href="/theme/normalize.css"/>
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">搜索引擎 9238 谈怎样学搜索</h1>
</header><p>
「搜索引擎 9238」是俞军的网名。
</p>

<ol class="org-ol">
<li>每天至少 200 次搜索，持续一年以上</li>
<li>阅读可收集到的任何搜索相关文章，至少 5000 篇，至少一半是英文。</li>
<li>把任何可利用时间用于思考搜索，把眼前看到及脑中想到的任何事物及文字都用搜索来描述和验证。</li>
<li>任何别人搜索过的案例，一定仿照一遍，并做 10 倍以上的变化搜索，至少半年。</li>
<li>对你最感兴趣的一门领域，深入了解它，彻底跟踪该领域内任何信息，包括你极尽所能收集到的任何角度、任何位置、任何媒体、任何人、任何形式的信息，直到你弄清除信息是怎样出生、成长、生病、死亡，维持这种状态绝不可短于 1 年。</li>
<li>阅读任何人文学科著作至少 1000 本，其中至少 100 本哲学和心理学作品，不要放过任何所谓经典著作。培养至少 10 门爱好，完成初阶的学习过程，精通其中至少 2 门。至少 15 个省以上的旅行。至少更换 5 个不同的工作。直到你能把握信息的生老病死背后是什么!</li>
<li>以感情入搜索。我的力量来源于愤怒！内心深处的愤怒，改变世界的信念支持我在每次搜索时尽全力并得到足够的回报。你不一定要这样。</li>
</ol>
</div>
</body>
</html>